app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def new
    @page = Page.new({:subject_id => @subject.id, :name => "Default"})
    @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1
---
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def create
    @page = Page.new(page_params)
    if @page.save
---
INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (10, 'Pulgarcito', 'El link', 10, 1, '2015-03-31 14:46:08.934784', '2015-03-31 14:46:08.934784')

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
UPDATE `pages` SET `subject_id` = 5, `position` = 1, `updated_at` = '2015-04-06 17:03:54.473088' WHERE `pages`.`id` = 4

  def delete
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1

  def destroy
    page = Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 2
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1

  def find_subject
    if params[:subject_id]
      @subject = Subject.find(params[:subject_id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1