app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def new
    @section = Section.new({:name => "Default"})
    @pages = Page.order('position ASC')
---
SELECT `pages`.* FROM `pages`  ORDER BY position ASC

  def create
    @section = Section.new(section_params)
    if @section.save
---
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (10, 'Perfumería', 7, 1, 'No recuerdo', 'El libro completoº', '2015-03-31 14:47:54.753679', '2015-03-31 14:47:54.753679')

  def edit
    @pages = Page.order('position ASC')
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def update
     @section = Section.find(params[:id])
    if @section.update_attributes(section_params)
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1
UPDATE `sections` SET `content` = 'El libro completo', `updated_at` = '2015-03-31 14:48:57.476639' WHERE `sections`.`id` = 3

  def delete
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def destroy
    section = Section.find(params[:id]).destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 1
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1