app/controllers/subjects_controller.rb

  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    @subject = Subject.new(subject_params)

    if @subject.save
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Bioquimica', 3, 1, '2015-03-29 18:00:59.316789', '2015-03-29 18:00:59.316789')

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update

    @subject = Subject.find(params[:id])

    if @subject.update_attributes(subject_params)

      flash[:notice] = "Subject updated successfully."
      redirect_to(:action => 'show', :id => @subject.id)
    else
      @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
UPDATE `subjects` SET `name` = 'Ruby00000000000000000000000000000000000000000000000000000000000000000009999999999999999999999999', `created_at` = '2015-03-22 16:20:00.000000', `updated_at` = '2015-04-10 11:38:01.942296' WHERE `subjects`.`id` = 1
SELECT COUNT(*) FROM `subjects`

  def destroy
    subject = Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 4
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1